app/controllers/AuditController.rb

SELECT "audits".* FROM "audits" WHERE "audits"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        params1 = params.permit(:id)
        @audit = Audited::Audit.find(params[:id])