app/controllers/ProductController.rb

INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at", "lock_version") VALUES (?, ?, ?, ?, ?, ?)  [["name", "product2"], ["description", "test"], ["price", 589], ["created_at", "2019-09-08 11:46:46.135310"], ["updated_at", "2019-09-08 11:46:46.135310"], ["lock_version", 0]]
---
    def create
        params1 = params.permit(:name, :price, :description)
      begin
        Product.create(params1)

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "name" = ?, "description" = ?, "lock_version" = ?, "updated_at" = ? WHERE "products"."id" = ? AND "products"."lock_version" = ?  [["name", "test1ssSsS"], ["description", "hello"], ["lock_version", 9], ["updated_at", "2019-09-08 12:33:46.386014"], ["id", 1], ["lock_version", 8]]
---
    def update
      begin
        params1 = params.permit(:name, :price, :description,:id,:lock_version)
        @product = Product.find(params1[:id]).update_attributes(params1)